{
  "backend/main.mo": "Empty Motoko actor with no backend logic.",
  "feature_evidence.json": "Feature evidence report mapping two UI features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file.",
  "frontend/index.css": "Tailwind base layers defining light/dark theme OKLCH color tokens and global element styling.",
  "frontend/index.html": "HTML entry point with meta tags and root element loading the React app.",
  "frontend/src/App.tsx": "Main React component assembling the site layout with header, sections, and footer.",
  "frontend/src/components/LogoMark.tsx": "Logo component rendering the PATIL Construction logo with styled container for contrast.",
  "frontend/src/components/Sections/AboutSection.tsx": "About section showing company description, highlights list, and a stats card.",
  "frontend/src/components/Sections/ContactSection.tsx": "Contact section with form validation, contact info cards, and business hours set to Always Open.",
  "frontend/src/components/Sections/HeroSection.tsx": "Hero section with banner image, headline content, and buttons that scroll to services or contact.",
  "frontend/src/components/Sections/ServicesSection.tsx": "Services section rendering service cards with mapped icons and descriptions from siteCopy.",
  "frontend/src/components/SiteFooter.tsx": "Footer containing logo, quick links, services list, and attribution with dynamic year.",
  "frontend/src/components/SiteHeader.tsx": "Responsive site header with logo and navigation, including mobile sheet menu and smooth scrolling to sections.",
  "frontend/src/content/siteCopy.ts": "Contains site marketing copy for hero, about, and services sections as structured text content.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor using React Query, updating when Internet Identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, logout, stored identities, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file exporting nothing for future React Query hooks.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables defining light and dark construction-themed color palettes.",
  "frontend/src/main.tsx": "App entry point initializing React, React Query, and Internet Identity provider.",
  "frontend/tailwind.config.js": "Tailwind configuration with custom colors, fonts, animations, and plugins.",
  "project_state.json": "Metadata describing project state, features, requests, and internal versioning."
}