{
  "backend/main.mo": "Empty Motoko actor with no backend logic.",
  "feature_evidence.json": "Feature evidence report describing logo-processing functionality and related components.",
  "frontend-file-summaries.txt": "Collection of short summaries for all major frontend source files.",
  "frontend/index.css": "Tailwind base styles and OKLCH color tokens for light and dark themes.",
  "frontend/index.html": "HTML entry point with meta tags and script loader for the React app.",
  "frontend/src/App.tsx": "Root React component assembling header, sections, and footer.",
  "frontend/src/components/LogoMark.tsx": "Logo component rendering the generated PATIL logo asset.",
  "frontend/src/components/Sections/AboutSection.tsx": "About section showing company description, highlights, and a stats card.",
  "frontend/src/components/Sections/ContactSection.tsx": "Contact form with validation plus contact info and business hours.",
  "frontend/src/components/Sections/HeroSection.tsx": "Hero banner with intro text, background image, and navigation buttons.",
  "frontend/src/components/Sections/ServicesSection.tsx": "Services grid rendering service cards with icons and descriptions.",
  "frontend/src/components/SiteFooter.tsx": "Footer with logo, quick links, services list, and attribution.",
  "frontend/src/components/SiteHeader.tsx": "Responsive header with logo and navigation links, including a mobile menu using a sheet and smooth scroll behavior.",
  "frontend/src/content/siteCopy.ts": "Static content definitions for hero, about, and detailed service descriptions used across the site.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches a backend actor tied to Internet Identity authentication and invalidates queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity auth state, including login, logout, and loading stored identities.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for future React Query hooks; currently exports nothing.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables defining a construction-themed color palette and dark mode.",
  "frontend/src/main.tsx": "Application entry point that mounts React, sets up React Query, and wraps the app with the Internet Identity provider.",
  "frontend/tailwind.config.js": "Tailwind configuration with extended colors, fonts, animations, container settings, and plugins for typography and animations.",
  "project_state.json": "Project metadata tracking features, requirements, logo-processing tasks, and pending clarifications."
}