{
  "backend/main.mo": "Minimal Motoko actor with no methods.",
  "feature_evidence.json": "Empty feature evidence report structure.",
  "frontend-file-summaries.txt": "Text file listing human-written summaries for various frontend source files.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables and global styles for light and dark modes.",
  "frontend/index.html": "Main HTML entry point with meta tags and script loading the React app.",
  "frontend/src/App.tsx": "Root React component assembling header, sections, and footer.",
  "frontend/src/components/Sections/AboutSection.tsx": "About section showing company description, highlights list, and a 15+ years stats card.",
  "frontend/src/components/Sections/ContactSection.tsx": "Contact section with validation-enabled form, contact info, and business hours.",
  "frontend/src/components/Sections/HeroSection.tsx": "Hero section with background image, intro text, and buttons scrolling to sections.",
  "frontend/src/components/Sections/ServicesSection.tsx": "Services grid rendering cards using icons mapped from service IDs.",
  "frontend/src/components/SiteFooter.tsx": "Footer with company info, quick links, service list, and attribution link.",
  "frontend/src/components/SiteHeader.tsx": "Sticky header with logo, responsive navigation, and mobile sheet menu.",
  "frontend/src/content/siteCopy.ts": "Defines all marketing copy for the site, including hero text, about section, and detailed service descriptions.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context and provider, handling login, stored identity loading, and identity lifecycle states.",
  "frontend/src/hooks/useQueries.ts": "Placeholder hook returning no backend queries for the static marketing site.",
  "frontend/src/index.css": "Tailwind base styles and custom OKLCH color variables defining the site's construction-themed light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind configuration extending fonts, colors, animations, and utilities using the custom OKLCH theme.",
  "project_state.json": "Describes the project state, requirements, known issues, and current website features for PATIL Construction."
}